JolanTho/2425_ESE_Projet_Tom_et_Jerry/software/Tom_n_Jerry_RTOS/Tom_n_Jerry_RTOS.ioc
USBPD.Is_SecurityRequest_Supported_P0=USBPD_TRUE
USBPD.Is_SrcCapaExt_Supported_P0=USBPD_TRUE
USBPD.PE_AttemptsDiscovSOP_P0=USBPD_TRUE
USBPD.PE_CapscounterSupport_P0=USBPD_TRUE
USBPD.PE_DataSwap_P0=USBPD_TRUE
USBPD.PE_RespondsToDiscovSOP_P0=USBPD_TRUE
USBPD.PE_UnchunkSupport_P0=USBPD_TRUE
USBPD.PE_VconnSwap_P0=USBPD_TRUE
USBPD.USBPD_PDO_FIXED_EXT_POWER_P0=VUSBPD_PDO_FIXED_EXT_POWER_SUPPORTED
USBPD.USBPD_PDO_FIXED_HIGHERCAPAB_P0=USBPD_PDO_SNK_FIXED_HIGHERCAPAB_SUPPORTED
USBPD.USBPD_PDO_FIXED_USBCOMM_P0=USBPD_PDO_FIXED_USBCOMM_SUPPORTED
USBPD.USBPD_PDO_FIXED_USBSUSPEND_P0=USBPD_PDO_SRC_FIXED_USBSUSPEND_SUPPORTED
USBPD.USBPD_PORT0_PDO_SNK_FIXED_SET_OP_CURRENT_0=3000
USBPD.USBPD_PORT0_PDO_SNK_FIXED_SET_VOLTAGE_0=9000
VP_FREERTOS_VS_CMSIS_V1.Mode=CMSIS_V1
VP_FREERTOS_VS_CMSIS_V1.Signal=FREERTOS_VS_CMSIS_V1
VP_SYS_VS_DBSignals.Mode=DisableDeadBatterySignals
VP_SYS_VS_DBSignals.Signal=SYS_VS_DBSignals
VP_SYS_VS_tim17.Mode=TIM17
VP_SYS_VS_tim17.Signal=SYS_VS_tim17
VP_TIM15_VS_ClockSourceINT.Mode=Internal
VP_TIM15_VS_ClockSourceINT.Signal=TIM15_VS_ClockSourceINT
VP_TIM16_VS_ClockSourceINT.Mode=Enable_Timer
VP_TIM16_VS_ClockSourceINT.Signal=TIM16_VS_ClockSourceINT
VP_TIM2_VS_ClockSourceINT.Mode=Internal
VP_TIM2_VS_ClockSourceINT.Signal=TIM2_VS_ClockSourceINT
VP_TIM4_VS_ClockSourceINT.Mode=Internal
VP_TIM4_VS_ClockSourceINT.Signal=TIM4_VS_ClockSourceINT
VP_USBPD_VS_PD3MINSNK.Mode=PD3_Min_Snk
VP_USBPD_VS_PD3MINSNK.Signal=USBPD_VS_PD3MINSNK
VP_USBPD_VS_USBPD1.Mode=USBPD_P0
VP_USBPD_VS_USBPD1.Signal=USBPD_VS_USBPD1
VP_USBPD_VS_usbpd_tim1.Mode=TIM1
VP_USBPD_VS_usbpd_tim1.Signal=USBPD_VS_usbpd_tim1
board=custom
rtos.0.ip=FREERTOS
isbadioc=false
